InformationRegisters/ПараметрыПодключенияWEB.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>ПараметрыПодключенияWEB</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>user</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>password</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>base_name</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>http</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>port</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>key</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ОбщегоНазначенияСерверWEB/Ext/Module.bsl
Функция ПолучитьHTTPСоединение(Ключ) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	СтруктураURI = Новый Структура("http,port,base,user,password");
	
	//пока берем первые параметры. Временно ...
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("key",Ключ);
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	Параметры.http КАК http,
		|	Параметры.port КАК port,
		|	Параметры.user КАК user,
		|	Параметры.base_name КАК base,
		|	Параметры.password КАК password
		|ИЗ
		|	РегистрСведений.ПараметрыПодключенияWEB КАК Параметры
		|ГДЕ
		|	Параметры.key = &key";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если  Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураURI, Выборка);
	Иначе
		Возврат Неопределено
	КонецЕсли;
	
	HTTPСоединение = Новый HTTPСоединение(СтруктураURI.http,СтруктураURI.port, СтруктураURI.user, СтруктураURI.password); 
	
	Возврат Новый Структура("HTTP, СтруктураURI", HTTPСоединение, СтруктураURI); 
	 
КонецФункции
